GopalSaraf/Practicals/PSDL/include/proc/pic18f47q84.inc
// Register: C1FLTOBJ0U
#define C1FLTOBJ0U C1FLTOBJ0U
C1FLTOBJ0U                               equ 018Eh
// bitfield definitions
C1FLTOBJ0U_EID_POSN                      equ 0000h
C1FLTOBJ0U_EID_POSITION                  equ 0000h
C1FLTOBJ0U_EID_SIZE                      equ 0008h
C1FLTOBJ0U_EID_LENGTH                    equ 0008h
C1FLTOBJ0U_EID_MASK                      equ 00FFh
C1FLTOBJ0U_EID5_POSN                     equ 0000h
C1FLTOBJ0U_EID5_POSITION                 equ 0000h
C1FLTOBJ0U_EID5_SIZE                     equ 0001h
C1FLTOBJ0U_EID5_LENGTH                   equ 0001h
C1FLTOBJ0U_EID5_MASK                     equ 0001h
C1FLTOBJ0U_EID6_POSN                     equ 0001h
C1FLTOBJ0U_EID6_POSITION                 equ 0001h
C1FLTOBJ0U_EID6_SIZE                     equ 0001h
C1FLTOBJ0U_EID6_LENGTH                   equ 0001h
C1FLTOBJ0U_EID6_MASK                     equ 0002h
C1FLTOBJ0U_EID7_POSN                     equ 0002h
C1FLTOBJ0U_EID7_POSITION                 equ 0002h
C1FLTOBJ0U_EID7_SIZE                     equ 0001h
C1FLTOBJ0U_EID7_LENGTH                   equ 0001h
C1FLTOBJ0U_EID7_MASK                     equ 0004h
C1FLTOBJ0U_EID8_POSN                     equ 0003h
C1FLTOBJ0U_EID8_POSITION                 equ 0003h
C1FLTOBJ0U_EID8_SIZE                     equ 0001h
C1FLTOBJ0U_EID8_LENGTH                   equ 0001h
C1FLTOBJ0U_EID8_MASK                     equ 0008h
C1FLTOBJ0U_EID9_POSN                     equ 0004h
C1FLTOBJ0U_EID9_POSITION                 equ 0004h
C1FLTOBJ0U_EID9_SIZE                     equ 0001h
C1FLTOBJ0U_EID9_LENGTH                   equ 0001h
C1FLTOBJ0U_EID9_MASK                     equ 0010h
C1FLTOBJ0U_EID10_POSN                    equ 0005h
C1FLTOBJ0U_EID10_POSITION                equ 0005h
C1FLTOBJ0U_EID10_SIZE                    equ 0001h
C1FLTOBJ0U_EID10_LENGTH                  equ 0001h
C1FLTOBJ0U_EID10_MASK                    equ 0020h
C1FLTOBJ0U_EID11_POSN                    equ 0006h
C1FLTOBJ0U_EID11_POSITION                equ 0006h
C1FLTOBJ0U_EID11_SIZE                    equ 0001h
C1FLTOBJ0U_EID11_LENGTH                  equ 0001h
C1FLTOBJ0U_EID11_MASK                    equ 0040h
C1FLTOBJ0U_EID12_POSN                    equ 0007h
C1FLTOBJ0U_EID12_POSITION                equ 0007h
C1FLTOBJ0U_EID12_SIZE                    equ 0001h
C1FLTOBJ0U_EID12_LENGTH                  equ 0001h
C1FLTOBJ0U_EID12_MASK                    equ 0080h

// Register: C1FLTOBJ0T
#define C1FLTOBJ0T C1FLTOBJ0T
C1FLTOBJ0T                               equ 018Fh
// bitfield definitions
C1FLTOBJ0T_EID_POSN                      equ 0000h
C1FLTOBJ0T_EID_POSITION                  equ 0000h
C1FLTOBJ0T_EID_SIZE                      equ 0005h
C1FLTOBJ0T_EID_LENGTH                    equ 0005h
C1FLTOBJ0T_EID_MASK                      equ 001Fh
C1FLTOBJ0T_SID11_POSN                    equ 0005h
C1FLTOBJ0T_SID11_POSITION                equ 0005h
C1FLTOBJ0T_SID11_SIZE                    equ 0001h
C1FLTOBJ0T_SID11_LENGTH                  equ 0001h
C1FLTOBJ0T_SID11_MASK                    equ 0020h
C1FLTOBJ0T_EXIDE_POSN                    equ 0006h
C1FLTOBJ0T_EXIDE_POSITION                equ 0006h
C1FLTOBJ0T_EXIDE_SIZE                    equ 0001h
C1FLTOBJ0T_EXIDE_LENGTH                  equ 0001h
C1FLTOBJ0T_EXIDE_MASK                    equ 0040h
C1FLTOBJ0T_EID13_POSN                    equ 0000h
C1FLTOBJ0T_EID13_POSITION                equ 0000h
C1FLTOBJ0T_EID13_SIZE                    equ 0001h
C1FLTOBJ0T_EID13_LENGTH                  equ 0001h
C1FLTOBJ0T_EID13_MASK                    equ 0001h
C1FLTOBJ0T_EID14_POSN                    equ 0001h
C1FLTOBJ0T_EID14_POSITION                equ 0001h
C1FLTOBJ0T_EID14_SIZE                    equ 0001h
C1FLTOBJ0T_EID14_LENGTH                  equ 0001h
C1FLTOBJ0T_EID14_MASK                    equ 0002h
C1FLTOBJ0T_EID15_POSN                    equ 0002h
C1FLTOBJ0T_EID15_POSITION                equ 0002h
C1FLTOBJ0T_EID15_SIZE                    equ 0001h
C1FLTOBJ0T_EID15_LENGTH                  equ 0001h
C1FLTOBJ0T_EID15_MASK                    equ 0004h
C1FLTOBJ0T_EID16_POSN                    equ 0003h
C1FLTOBJ0T_EID16_POSITION                equ 0003h
C1FLTOBJ0T_EID16_SIZE                    equ 0001h
C1FLTOBJ0T_EID16_LENGTH                  equ 0001h
C1FLTOBJ0T_EID16_MASK                    equ 0008h
C1FLTOBJ0T_EID17_POSN                    equ 0004h
C1FLTOBJ0T_EID17_POSITION                equ 0004h
C1FLTOBJ0T_EID17_SIZE                    equ 0001h
C1FLTOBJ0T_EID17_LENGTH                  equ 0001h
C1FLTOBJ0T_EID17_MASK                    equ 0010h

// Register: C1MASK0
#define C1MASK0 C1MASK0
C1MASK0                                  equ 0190h

// Register: C1MASK0L
#define C1MASK0L C1MASK0L
C1MASK0L                                 equ 0190h
// bitfield definitions
C1MASK0L_MSID_POSN                       equ 0000h
C1MASK0L_MSID_POSITION                   equ 0000h
C1MASK0L_MSID_SIZE                       equ 0008h
C1MASK0L_MSID_LENGTH                     equ 0008h
C1MASK0L_MSID_MASK                       equ 00FFh
C1MASK0L_MSID0_POSN                      equ 0000h
C1MASK0L_MSID0_POSITION                  equ 0000h
C1MASK0L_MSID0_SIZE                      equ 0001h
C1MASK0L_MSID0_LENGTH                    equ 0001h
C1MASK0L_MSID0_MASK                      equ 0001h
C1MASK0L_MSID1_POSN                      equ 0001h
C1MASK0L_MSID1_POSITION                  equ 0001h
C1MASK0L_MSID1_SIZE                      equ 0001h
C1MASK0L_MSID1_LENGTH                    equ 0001h
C1MASK0L_MSID1_MASK                      equ 0002h
C1MASK0L_MSID2_POSN                      equ 0002h
C1MASK0L_MSID2_POSITION                  equ 0002h
C1MASK0L_MSID2_SIZE                      equ 0001h
C1MASK0L_MSID2_LENGTH                    equ 0001h
C1MASK0L_MSID2_MASK                      equ 0004h
C1MASK0L_MSID3_POSN                      equ 0003h
C1MASK0L_MSID3_POSITION                  equ 0003h
C1MASK0L_MSID3_SIZE                      equ 0001h
C1MASK0L_MSID3_LENGTH                    equ 0001h
C1MASK0L_MSID3_MASK                      equ 0008h
C1MASK0L_MSID4_POSN                      equ 0004h
C1MASK0L_MSID4_POSITION                  equ 0004h
C1MASK0L_MSID4_SIZE                      equ 0001h
C1MASK0L_MSID4_LENGTH                    equ 0001h
C1MASK0L_MSID4_MASK                      equ 0010h
C1MASK0L_MSID5_POSN                      equ 0005h
C1MASK0L_MSID5_POSITION                  equ 0005h
C1MASK0L_MSID5_SIZE                      equ 0001h
C1MASK0L_MSID5_LENGTH                    equ 0001h
C1MASK0L_MSID5_MASK                      equ 0020h
C1MASK0L_MSID6_POSN                      equ 0006h
C1MASK0L_MSID6_POSITION                  equ 0006h
C1MASK0L_MSID6_SIZE                      equ 0001h
C1MASK0L_MSID6_LENGTH                    equ 0001h
C1MASK0L_MSID6_MASK                      equ 0040h
C1MASK0L_MSID7_POSN                      equ 0007h
C1MASK0L_MSID7_POSITION                  equ 0007h
C1MASK0L_MSID7_SIZE                      equ 0001h
C1MASK0L_MSID7_LENGTH                    equ 0001h
C1MASK0L_MSID7_MASK                      equ 0080h

// Register: C1MASK0H
#define C1MASK0H C1MASK0H
C1MASK0H                                 equ 0191h
// bitfield definitions
C1MASK0H_MSID_POSN                       equ 0000h
C1MASK0H_MSID_POSITION                   equ 0000h
C1MASK0H_MSID_SIZE                       equ 0003h
C1MASK0H_MSID_LENGTH                     equ 0003h
C1MASK0H_MSID_MASK                       equ 0007h
C1MASK0H_MEID_POSN                       equ 0003h
C1MASK0H_MEID_POSITION                   equ 0003h
C1MASK0H_MEID_SIZE                       equ 0005h
C1MASK0H_MEID_LENGTH                     equ 0005h
C1MASK0H_MEID_MASK                       equ 00F8h
C1MASK0H_MSID8_POSN                      equ 0000h
C1MASK0H_MSID8_POSITION                  equ 0000h
C1MASK0H_MSID8_SIZE                      equ 0001h
C1MASK0H_MSID8_LENGTH                    equ 0001h
C1MASK0H_MSID8_MASK                      equ 0001h
C1MASK0H_MSID9_POSN                      equ 0001h
C1MASK0H_MSID9_POSITION                  equ 0001h
C1MASK0H_MSID9_SIZE                      equ 0001h
C1MASK0H_MSID9_LENGTH                    equ 0001h
C1MASK0H_MSID9_MASK                      equ 0002h
C1MASK0H_MSID10_POSN                     equ 0002h
C1MASK0H_MSID10_POSITION                 equ 0002h
C1MASK0H_MSID10_SIZE                     equ 0001h
C1MASK0H_MSID10_LENGTH                   equ 0001h
C1MASK0H_MSID10_MASK                     equ 0004h
C1MASK0H_MEID0_POSN                      equ 0003h
C1MASK0H_MEID0_POSITION                  equ 0003h
C1MASK0H_MEID0_SIZE                      equ 0001h
C1MASK0H_MEID0_LENGTH                    equ 0001h
C1MASK0H_MEID0_MASK                      equ 0008h
C1MASK0H_MEID1_POSN                      equ 0004h
C1MASK0H_MEID1_POSITION                  equ 0004h
C1MASK0H_MEID1_SIZE                      equ 0001h
C1MASK0H_MEID1_LENGTH                    equ 0001h
C1MASK0H_MEID1_MASK                      equ 0010h
C1MASK0H_MEID2_POSN                      equ 0005h
C1MASK0H_MEID2_POSITION                  equ 0005h
C1MASK0H_MEID2_SIZE                      equ 0001h
C1MASK0H_MEID2_LENGTH                    equ 0001h
C1MASK0H_MEID2_MASK                      equ 0020h
C1MASK0H_MEID3_POSN                      equ 0006h
C1MASK0H_MEID3_POSITION                  equ 0006h
C1MASK0H_MEID3_SIZE                      equ 0001h
C1MASK0H_MEID3_LENGTH                    equ 0001h
C1MASK0H_MEID3_MASK                      equ 0040h
C1MASK0H_MEID4_POSN                      equ 0007h
C1MASK0H_MEID4_POSITION                  equ 0007h
C1MASK0H_MEID4_SIZE                      equ 0001h
C1MASK0H_MEID4_LENGTH                    equ 0001h
C1MASK0H_MEID4_MASK                      equ 0080h

// Register: C1MASK0U
#define C1MASK0U C1MASK0U
C1MASK0U                                 equ 0192h
// bitfield definitions
C1MASK0U_MEID_POSN                       equ 0000h
C1MASK0U_MEID_POSITION                   equ 0000h
C1MASK0U_MEID_SIZE                       equ 0008h
C1MASK0U_MEID_LENGTH                     equ 0008h
C1MASK0U_MEID_MASK                       equ 00FFh
C1MASK0U_MEID5_POSN                      equ 0000h
C1MASK0U_MEID5_POSITION                  equ 0000h
C1MASK0U_MEID5_SIZE                      equ 0001h
C1MASK0U_MEID5_LENGTH                    equ 0001h
C1MASK0U_MEID5_MASK                      equ 0001h
C1MASK0U_MEID6_POSN                      equ 0001h
C1MASK0U_MEID6_POSITION                  equ 0001h
C1MASK0U_MEID6_SIZE                      equ 0001h
C1MASK0U_MEID6_LENGTH                    equ 0001h
C1MASK0U_MEID6_MASK                      equ 0002h
C1MASK0U_MEID7_POSN                      equ 0002h
C1MASK0U_MEID7_POSITION                  equ 0002h
C1MASK0U_MEID7_SIZE                      equ 0001h
C1MASK0U_MEID7_LENGTH                    equ 0001h
C1MASK0U_MEID7_MASK                      equ 0004h
C1MASK0U_MEID8_POSN                      equ 0003h
C1MASK0U_MEID8_POSITION                  equ 0003h
C1MASK0U_MEID8_SIZE                      equ 0001h
C1MASK0U_MEID8_LENGTH                    equ 0001h
C1MASK0U_MEID8_MASK                      equ 0008h
C1MASK0U_MEID9_POSN                      equ 0004h
C1MASK0U_MEID9_POSITION                  equ 0004h
C1MASK0U_MEID9_SIZE                      equ 0001h
C1MASK0U_MEID9_LENGTH                    equ 0001h
C1MASK0U_MEID9_MASK                      equ 0010h
C1MASK0U_MEID10_POSN                     equ 0005h
C1MASK0U_MEID10_POSITION                 equ 0005h
C1MASK0U_MEID10_SIZE                     equ 0001h
C1MASK0U_MEID10_LENGTH                   equ 0001h
C1MASK0U_MEID10_MASK                     equ 0020h
C1MASK0U_MEID11_POSN                     equ 0006h
C1MASK0U_MEID11_POSITION                 equ 0006h
C1MASK0U_MEID11_SIZE                     equ 0001h
C1MASK0U_MEID11_LENGTH                   equ 0001h
C1MASK0U_MEID11_MASK                     equ 0040h
C1MASK0U_MEID12_POSN                     equ 0007h
C1MASK0U_MEID12_POSITION                 equ 0007h
C1MASK0U_MEID12_SIZE                     equ 0001h
C1MASK0U_MEID12_LENGTH                   equ 0001h
C1MASK0U_MEID12_MASK                     equ 0080h

