GopalSaraf/Practicals/PSDL/include/proc/pic18f47q84.inc
// Register: ODCOND
#define ODCOND ODCOND
ODCOND                                   equ 041Ah
// bitfield definitions
ODCOND_ODCD0_POSN                        equ 0000h
ODCOND_ODCD0_POSITION                    equ 0000h
ODCOND_ODCD0_SIZE                        equ 0001h
ODCOND_ODCD0_LENGTH                      equ 0001h
ODCOND_ODCD0_MASK                        equ 0001h
ODCOND_ODCD1_POSN                        equ 0001h
ODCOND_ODCD1_POSITION                    equ 0001h
ODCOND_ODCD1_SIZE                        equ 0001h
ODCOND_ODCD1_LENGTH                      equ 0001h
ODCOND_ODCD1_MASK                        equ 0002h
ODCOND_ODCD2_POSN                        equ 0002h
ODCOND_ODCD2_POSITION                    equ 0002h
ODCOND_ODCD2_SIZE                        equ 0001h
ODCOND_ODCD2_LENGTH                      equ 0001h
ODCOND_ODCD2_MASK                        equ 0004h
ODCOND_ODCD3_POSN                        equ 0003h
ODCOND_ODCD3_POSITION                    equ 0003h
ODCOND_ODCD3_SIZE                        equ 0001h
ODCOND_ODCD3_LENGTH                      equ 0001h
ODCOND_ODCD3_MASK                        equ 0008h
ODCOND_ODCD4_POSN                        equ 0004h
ODCOND_ODCD4_POSITION                    equ 0004h
ODCOND_ODCD4_SIZE                        equ 0001h
ODCOND_ODCD4_LENGTH                      equ 0001h
ODCOND_ODCD4_MASK                        equ 0010h
ODCOND_ODCD5_POSN                        equ 0005h
ODCOND_ODCD5_POSITION                    equ 0005h
ODCOND_ODCD5_SIZE                        equ 0001h
ODCOND_ODCD5_LENGTH                      equ 0001h
ODCOND_ODCD5_MASK                        equ 0020h
ODCOND_ODCD6_POSN                        equ 0006h
ODCOND_ODCD6_POSITION                    equ 0006h
ODCOND_ODCD6_SIZE                        equ 0001h
ODCOND_ODCD6_LENGTH                      equ 0001h
ODCOND_ODCD6_MASK                        equ 0040h
ODCOND_ODCD7_POSN                        equ 0007h
ODCOND_ODCD7_POSITION                    equ 0007h
ODCOND_ODCD7_SIZE                        equ 0001h
ODCOND_ODCD7_LENGTH                      equ 0001h
ODCOND_ODCD7_MASK                        equ 0080h

// Register: SLRCOND
#define SLRCOND SLRCOND
SLRCOND                                  equ 041Bh
// bitfield definitions
SLRCOND_SLRD0_POSN                       equ 0000h
SLRCOND_SLRD0_POSITION                   equ 0000h
SLRCOND_SLRD0_SIZE                       equ 0001h
SLRCOND_SLRD0_LENGTH                     equ 0001h
SLRCOND_SLRD0_MASK                       equ 0001h
SLRCOND_SLRD1_POSN                       equ 0001h
SLRCOND_SLRD1_POSITION                   equ 0001h
SLRCOND_SLRD1_SIZE                       equ 0001h
SLRCOND_SLRD1_LENGTH                     equ 0001h
SLRCOND_SLRD1_MASK                       equ 0002h
SLRCOND_SLRD2_POSN                       equ 0002h
SLRCOND_SLRD2_POSITION                   equ 0002h
SLRCOND_SLRD2_SIZE                       equ 0001h
SLRCOND_SLRD2_LENGTH                     equ 0001h
SLRCOND_SLRD2_MASK                       equ 0004h
SLRCOND_SLRD3_POSN                       equ 0003h
SLRCOND_SLRD3_POSITION                   equ 0003h
SLRCOND_SLRD3_SIZE                       equ 0001h
SLRCOND_SLRD3_LENGTH                     equ 0001h
SLRCOND_SLRD3_MASK                       equ 0008h
SLRCOND_SLRD4_POSN                       equ 0004h
SLRCOND_SLRD4_POSITION                   equ 0004h
SLRCOND_SLRD4_SIZE                       equ 0001h
SLRCOND_SLRD4_LENGTH                     equ 0001h
SLRCOND_SLRD4_MASK                       equ 0010h
SLRCOND_SLRD5_POSN                       equ 0005h
SLRCOND_SLRD5_POSITION                   equ 0005h
SLRCOND_SLRD5_SIZE                       equ 0001h
SLRCOND_SLRD5_LENGTH                     equ 0001h
SLRCOND_SLRD5_MASK                       equ 0020h
SLRCOND_SLRD6_POSN                       equ 0006h
SLRCOND_SLRD6_POSITION                   equ 0006h
SLRCOND_SLRD6_SIZE                       equ 0001h
SLRCOND_SLRD6_LENGTH                     equ 0001h
SLRCOND_SLRD6_MASK                       equ 0040h
SLRCOND_SLRD7_POSN                       equ 0007h
SLRCOND_SLRD7_POSITION                   equ 0007h
SLRCOND_SLRD7_SIZE                       equ 0001h
SLRCOND_SLRD7_LENGTH                     equ 0001h
SLRCOND_SLRD7_MASK                       equ 0080h

// Register: INLVLD
#define INLVLD INLVLD
INLVLD                                   equ 041Ch
// bitfield definitions
INLVLD_INLVLD0_POSN                      equ 0000h
INLVLD_INLVLD0_POSITION                  equ 0000h
INLVLD_INLVLD0_SIZE                      equ 0001h
INLVLD_INLVLD0_LENGTH                    equ 0001h
INLVLD_INLVLD0_MASK                      equ 0001h
INLVLD_INLVLD1_POSN                      equ 0001h
INLVLD_INLVLD1_POSITION                  equ 0001h
INLVLD_INLVLD1_SIZE                      equ 0001h
INLVLD_INLVLD1_LENGTH                    equ 0001h
INLVLD_INLVLD1_MASK                      equ 0002h
INLVLD_INLVLD2_POSN                      equ 0002h
INLVLD_INLVLD2_POSITION                  equ 0002h
INLVLD_INLVLD2_SIZE                      equ 0001h
INLVLD_INLVLD2_LENGTH                    equ 0001h
INLVLD_INLVLD2_MASK                      equ 0004h
INLVLD_INLVLD3_POSN                      equ 0003h
INLVLD_INLVLD3_POSITION                  equ 0003h
INLVLD_INLVLD3_SIZE                      equ 0001h
INLVLD_INLVLD3_LENGTH                    equ 0001h
INLVLD_INLVLD3_MASK                      equ 0008h
INLVLD_INLVLD4_POSN                      equ 0004h
INLVLD_INLVLD4_POSITION                  equ 0004h
INLVLD_INLVLD4_SIZE                      equ 0001h
INLVLD_INLVLD4_LENGTH                    equ 0001h
INLVLD_INLVLD4_MASK                      equ 0010h
INLVLD_INLVLD5_POSN                      equ 0005h
INLVLD_INLVLD5_POSITION                  equ 0005h
INLVLD_INLVLD5_SIZE                      equ 0001h
INLVLD_INLVLD5_LENGTH                    equ 0001h
INLVLD_INLVLD5_MASK                      equ 0020h
INLVLD_INLVLD6_POSN                      equ 0006h
INLVLD_INLVLD6_POSITION                  equ 0006h
INLVLD_INLVLD6_SIZE                      equ 0001h
INLVLD_INLVLD6_LENGTH                    equ 0001h
INLVLD_INLVLD6_MASK                      equ 0040h
INLVLD_INLVLD7_POSN                      equ 0007h
INLVLD_INLVLD7_POSITION                  equ 0007h
INLVLD_INLVLD7_SIZE                      equ 0001h
INLVLD_INLVLD7_LENGTH                    equ 0001h
INLVLD_INLVLD7_MASK                      equ 0080h

