GopalSaraf/Practicals/PSDL/include/proc/pic18f47q84.inc
// Register: NCO2ACCL
#define NCO2ACCL NCO2ACCL
NCO2ACCL                                 equ 0448h
// bitfield definitions
NCO2ACCL_ACC_POSN                        equ 0000h
NCO2ACCL_ACC_POSITION                    equ 0000h
NCO2ACCL_ACC_SIZE                        equ 0008h
NCO2ACCL_ACC_LENGTH                      equ 0008h
NCO2ACCL_ACC_MASK                        equ 00FFh
NCO2ACCL_NCO2ACC0_POSN                   equ 0000h
NCO2ACCL_NCO2ACC0_POSITION               equ 0000h
NCO2ACCL_NCO2ACC0_SIZE                   equ 0001h
NCO2ACCL_NCO2ACC0_LENGTH                 equ 0001h
NCO2ACCL_NCO2ACC0_MASK                   equ 0001h
NCO2ACCL_NCO2ACC1_POSN                   equ 0001h
NCO2ACCL_NCO2ACC1_POSITION               equ 0001h
NCO2ACCL_NCO2ACC1_SIZE                   equ 0001h
NCO2ACCL_NCO2ACC1_LENGTH                 equ 0001h
NCO2ACCL_NCO2ACC1_MASK                   equ 0002h
NCO2ACCL_NCO2ACC2_POSN                   equ 0002h
NCO2ACCL_NCO2ACC2_POSITION               equ 0002h
NCO2ACCL_NCO2ACC2_SIZE                   equ 0001h
NCO2ACCL_NCO2ACC2_LENGTH                 equ 0001h
NCO2ACCL_NCO2ACC2_MASK                   equ 0004h
NCO2ACCL_NCO2ACC3_POSN                   equ 0003h
NCO2ACCL_NCO2ACC3_POSITION               equ 0003h
NCO2ACCL_NCO2ACC3_SIZE                   equ 0001h
NCO2ACCL_NCO2ACC3_LENGTH                 equ 0001h
NCO2ACCL_NCO2ACC3_MASK                   equ 0008h
NCO2ACCL_NCO2ACC4_POSN                   equ 0004h
NCO2ACCL_NCO2ACC4_POSITION               equ 0004h
NCO2ACCL_NCO2ACC4_SIZE                   equ 0001h
NCO2ACCL_NCO2ACC4_LENGTH                 equ 0001h
NCO2ACCL_NCO2ACC4_MASK                   equ 0010h
NCO2ACCL_NCO2ACC5_POSN                   equ 0005h
NCO2ACCL_NCO2ACC5_POSITION               equ 0005h
NCO2ACCL_NCO2ACC5_SIZE                   equ 0001h
NCO2ACCL_NCO2ACC5_LENGTH                 equ 0001h
NCO2ACCL_NCO2ACC5_MASK                   equ 0020h
NCO2ACCL_NCO2ACC6_POSN                   equ 0006h
NCO2ACCL_NCO2ACC6_POSITION               equ 0006h
NCO2ACCL_NCO2ACC6_SIZE                   equ 0001h
NCO2ACCL_NCO2ACC6_LENGTH                 equ 0001h
NCO2ACCL_NCO2ACC6_MASK                   equ 0040h
NCO2ACCL_NCO2ACC7_POSN                   equ 0007h
NCO2ACCL_NCO2ACC7_POSITION               equ 0007h
NCO2ACCL_NCO2ACC7_SIZE                   equ 0001h
NCO2ACCL_NCO2ACC7_LENGTH                 equ 0001h
NCO2ACCL_NCO2ACC7_MASK                   equ 0080h
NCO2ACCL_ACC0_POSN                       equ 0000h
NCO2ACCL_ACC0_POSITION                   equ 0000h
NCO2ACCL_ACC0_SIZE                       equ 0001h
NCO2ACCL_ACC0_LENGTH                     equ 0001h
NCO2ACCL_ACC0_MASK                       equ 0001h
NCO2ACCL_ACC1_POSN                       equ 0001h
NCO2ACCL_ACC1_POSITION                   equ 0001h
NCO2ACCL_ACC1_SIZE                       equ 0001h
NCO2ACCL_ACC1_LENGTH                     equ 0001h
NCO2ACCL_ACC1_MASK                       equ 0002h
NCO2ACCL_ACC2_POSN                       equ 0002h
NCO2ACCL_ACC2_POSITION                   equ 0002h
NCO2ACCL_ACC2_SIZE                       equ 0001h
NCO2ACCL_ACC2_LENGTH                     equ 0001h
NCO2ACCL_ACC2_MASK                       equ 0004h
NCO2ACCL_ACC3_POSN                       equ 0003h
NCO2ACCL_ACC3_POSITION                   equ 0003h
NCO2ACCL_ACC3_SIZE                       equ 0001h
NCO2ACCL_ACC3_LENGTH                     equ 0001h
NCO2ACCL_ACC3_MASK                       equ 0008h
NCO2ACCL_ACC4_POSN                       equ 0004h
NCO2ACCL_ACC4_POSITION                   equ 0004h
NCO2ACCL_ACC4_SIZE                       equ 0001h
NCO2ACCL_ACC4_LENGTH                     equ 0001h
NCO2ACCL_ACC4_MASK                       equ 0010h
NCO2ACCL_ACC5_POSN                       equ 0005h
NCO2ACCL_ACC5_POSITION                   equ 0005h
NCO2ACCL_ACC5_SIZE                       equ 0001h
NCO2ACCL_ACC5_LENGTH                     equ 0001h
NCO2ACCL_ACC5_MASK                       equ 0020h
NCO2ACCL_ACC6_POSN                       equ 0006h
NCO2ACCL_ACC6_POSITION                   equ 0006h
NCO2ACCL_ACC6_SIZE                       equ 0001h
NCO2ACCL_ACC6_LENGTH                     equ 0001h
NCO2ACCL_ACC6_MASK                       equ 0040h
NCO2ACCL_ACC7_POSN                       equ 0007h
NCO2ACCL_ACC7_POSITION                   equ 0007h
NCO2ACCL_ACC7_SIZE                       equ 0001h
NCO2ACCL_ACC7_LENGTH                     equ 0001h
NCO2ACCL_ACC7_MASK                       equ 0080h
NCO2ACCL_NCO2ACC_POSN                    equ 0000h
NCO2ACCL_NCO2ACC_POSITION                equ 0000h
NCO2ACCL_NCO2ACC_SIZE                    equ 0008h
NCO2ACCL_NCO2ACC_LENGTH                  equ 0008h
NCO2ACCL_NCO2ACC_MASK                    equ 00FFh

// Register: NCO2ACCH
#define NCO2ACCH NCO2ACCH
NCO2ACCH                                 equ 0449h
// bitfield definitions
NCO2ACCH_ACC_POSN                        equ 0000h
NCO2ACCH_ACC_POSITION                    equ 0000h
NCO2ACCH_ACC_SIZE                        equ 0008h
NCO2ACCH_ACC_LENGTH                      equ 0008h
NCO2ACCH_ACC_MASK                        equ 00FFh
NCO2ACCH_NCO2ACC8_POSN                   equ 0000h
NCO2ACCH_NCO2ACC8_POSITION               equ 0000h
NCO2ACCH_NCO2ACC8_SIZE                   equ 0001h
NCO2ACCH_NCO2ACC8_LENGTH                 equ 0001h
NCO2ACCH_NCO2ACC8_MASK                   equ 0001h
NCO2ACCH_NCO2ACC9_POSN                   equ 0001h
NCO2ACCH_NCO2ACC9_POSITION               equ 0001h
NCO2ACCH_NCO2ACC9_SIZE                   equ 0001h
NCO2ACCH_NCO2ACC9_LENGTH                 equ 0001h
NCO2ACCH_NCO2ACC9_MASK                   equ 0002h
NCO2ACCH_NCO2ACC10_POSN                  equ 0002h
NCO2ACCH_NCO2ACC10_POSITION              equ 0002h
NCO2ACCH_NCO2ACC10_SIZE                  equ 0001h
NCO2ACCH_NCO2ACC10_LENGTH                equ 0001h
NCO2ACCH_NCO2ACC10_MASK                  equ 0004h
NCO2ACCH_NCO2ACC11_POSN                  equ 0003h
NCO2ACCH_NCO2ACC11_POSITION              equ 0003h
NCO2ACCH_NCO2ACC11_SIZE                  equ 0001h
NCO2ACCH_NCO2ACC11_LENGTH                equ 0001h
NCO2ACCH_NCO2ACC11_MASK                  equ 0008h
NCO2ACCH_NCO2ACC12_POSN                  equ 0004h
NCO2ACCH_NCO2ACC12_POSITION              equ 0004h
NCO2ACCH_NCO2ACC12_SIZE                  equ 0001h
NCO2ACCH_NCO2ACC12_LENGTH                equ 0001h
NCO2ACCH_NCO2ACC12_MASK                  equ 0010h
NCO2ACCH_NCO2ACC13_POSN                  equ 0005h
NCO2ACCH_NCO2ACC13_POSITION              equ 0005h
NCO2ACCH_NCO2ACC13_SIZE                  equ 0001h
NCO2ACCH_NCO2ACC13_LENGTH                equ 0001h
NCO2ACCH_NCO2ACC13_MASK                  equ 0020h
NCO2ACCH_NCO2ACC14_POSN                  equ 0006h
NCO2ACCH_NCO2ACC14_POSITION              equ 0006h
NCO2ACCH_NCO2ACC14_SIZE                  equ 0001h
NCO2ACCH_NCO2ACC14_LENGTH                equ 0001h
NCO2ACCH_NCO2ACC14_MASK                  equ 0040h
NCO2ACCH_NCO2ACC15_POSN                  equ 0007h
NCO2ACCH_NCO2ACC15_POSITION              equ 0007h
NCO2ACCH_NCO2ACC15_SIZE                  equ 0001h
NCO2ACCH_NCO2ACC15_LENGTH                equ 0001h
NCO2ACCH_NCO2ACC15_MASK                  equ 0080h
NCO2ACCH_ACC8_POSN                       equ 0000h
NCO2ACCH_ACC8_POSITION                   equ 0000h
NCO2ACCH_ACC8_SIZE                       equ 0001h
NCO2ACCH_ACC8_LENGTH                     equ 0001h
NCO2ACCH_ACC8_MASK                       equ 0001h
NCO2ACCH_ACC9_POSN                       equ 0001h
NCO2ACCH_ACC9_POSITION                   equ 0001h
NCO2ACCH_ACC9_SIZE                       equ 0001h
NCO2ACCH_ACC9_LENGTH                     equ 0001h
NCO2ACCH_ACC9_MASK                       equ 0002h
NCO2ACCH_ACC10_POSN                      equ 0002h
NCO2ACCH_ACC10_POSITION                  equ 0002h
NCO2ACCH_ACC10_SIZE                      equ 0001h
NCO2ACCH_ACC10_LENGTH                    equ 0001h
NCO2ACCH_ACC10_MASK                      equ 0004h
NCO2ACCH_ACC11_POSN                      equ 0003h
NCO2ACCH_ACC11_POSITION                  equ 0003h
NCO2ACCH_ACC11_SIZE                      equ 0001h
NCO2ACCH_ACC11_LENGTH                    equ 0001h
NCO2ACCH_ACC11_MASK                      equ 0008h
NCO2ACCH_ACC12_POSN                      equ 0004h
NCO2ACCH_ACC12_POSITION                  equ 0004h
NCO2ACCH_ACC12_SIZE                      equ 0001h
NCO2ACCH_ACC12_LENGTH                    equ 0001h
NCO2ACCH_ACC12_MASK                      equ 0010h
NCO2ACCH_ACC13_POSN                      equ 0005h
NCO2ACCH_ACC13_POSITION                  equ 0005h
NCO2ACCH_ACC13_SIZE                      equ 0001h
NCO2ACCH_ACC13_LENGTH                    equ 0001h
NCO2ACCH_ACC13_MASK                      equ 0020h
NCO2ACCH_ACC14_POSN                      equ 0006h
NCO2ACCH_ACC14_POSITION                  equ 0006h
NCO2ACCH_ACC14_SIZE                      equ 0001h
NCO2ACCH_ACC14_LENGTH                    equ 0001h
NCO2ACCH_ACC14_MASK                      equ 0040h
NCO2ACCH_ACC15_POSN                      equ 0007h
NCO2ACCH_ACC15_POSITION                  equ 0007h
NCO2ACCH_ACC15_SIZE                      equ 0001h
NCO2ACCH_ACC15_LENGTH                    equ 0001h
NCO2ACCH_ACC15_MASK                      equ 0080h
NCO2ACCH_NCO2ACC_POSN                    equ 0000h
NCO2ACCH_NCO2ACC_POSITION                equ 0000h
NCO2ACCH_NCO2ACC_SIZE                    equ 0008h
NCO2ACCH_NCO2ACC_LENGTH                  equ 0008h
NCO2ACCH_NCO2ACC_MASK                    equ 00FFh

